app/controllers/bears_controller.rb

SELECT "bears".* FROM "bears"
---
  def index
   @bears = Bear.all

INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bear1"], ["description", "This is a new bear"], ["created_at", "2016-02-01 16:44:07.729856"], ["updated_at", "2016-02-01 16:44:07.729856"]]
---
  def create
   @bear = Bear.new(bear_params)
   if @bear.save

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @bear = Bear.find(params[:id])

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @bear = Bear.find(params[:id])

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "bears" SET "description" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["description", "This is a new bear77"], ["updated_at", "2016-02-01 16:47:16.903061"], ["id", 1]]
---
  def update
    @bear = Bear.find(params[:id])
    if @bear.update(bear_params)

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 1]]
---
  def destroy
    @bear = Bear.find(params[:id])
    @bear.destroy